GUdaoxi/LR_project1/Drivers/FM33LR0xx_FL_Driver/Inc/fm33lr0xx_fl_intmux.h
/**
  *******************************************************************************************************
  * @file    fm33lr0xx_fl_intmux.h
  * @author  FMSH Application Team
  * @brief   Head file of CMU FL Module
  * @version  V1.0.5
  * @date     29. June 2025
  ****************************************************************************************************
  * @attention
  * Copyright 2024 SHANGHAI FUDAN MICROELECTRONICS GROUP CO., LTD.(FUDAN MICRO.)
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met: 
  *
  * 1. Redistributions of source code must retain the above copyright notice,
  *    this list of conditions and the following disclaimer.
  *
  * 2. Redistributions in binary form must reproduce the above copyright notice,
  *    this list of conditions and the following disclaimer in the documentation
  *    and/or other materials provided with the distribution.
  *
  * 3. Neither the name of the copyright holder nor the names of its contributors
  *    may be used to endorse or promote products derived from this software without
  *    specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS"AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
  * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
  * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED
  * AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
  * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
  * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ****************************************************************************************************
  */


/* Define to prevent recursive inclusion---------------------------------------------------------------*/
#ifndef __FM33LR0XX_FL_INTMUX_H
#define __FM33LR0XX_FL_INTMUX_H

#ifdef __cplusplus
extern "C" {
#endif
/* Includes -------------------------------------------------------------------------------------------*/
#include "fm33lr0xx_fl_def.h"
/** @addtogroup FM33LR0XX_FL_Driver
  * @{
  */
/* Exported types -------------------------------------------------------------------------------------*/
/** @defgroup CMU_FL_ES_INIT INTMUX Exported Init structures
  * @{
  */


/**
  * @}
  */
/* Exported constants ---------------------------------------------------------------------------------*/
/** @defgroup INTMUX_FL_Exported_Constants INTMUX Exported Constants
  * @{
  */


#define    INTMUX_CR_MUX13SEL_Pos                                 (26U)
#define    INTMUX_CR_MUX13SEL_Msk                                 (0x3U << INTMUX_CR_MUX13SEL_Pos)
#define    INTMUX_CR_MUX13SEL                                     INTMUX_CR_MUX13SEL_Msk

#define    INTMUX_CR_MUX12SEL_Pos                                 (24U)
#define    INTMUX_CR_MUX12SEL_Msk                                 (0x3U << INTMUX_CR_MUX12SEL_Pos)
#define    INTMUX_CR_MUX12SEL                                     INTMUX_CR_MUX12SEL_Msk

#define    INTMUX_CR_MUX11SEL_Pos                                 (22U)
#define    INTMUX_CR_MUX11SEL_Msk                                 (0x3U << INTMUX_CR_MUX11SEL_Pos)
#define    INTMUX_CR_MUX11SEL                                     INTMUX_CR_MUX11SEL_Msk

#define    INTMUX_CR_MUX10SEL_Pos                                 (20U)
#define    INTMUX_CR_MUX10SEL_Msk                                 (0x3U << INTMUX_CR_MUX10SEL_Pos)
#define    INTMUX_CR_MUX10SEL                                     INTMUX_CR_MUX10SEL_Msk

#define    INTMUX_CR_MUX9SEL_Pos                                  (18U)
#define    INTMUX_CR_MUX9SEL_Msk                                  (0x3U << INTMUX_CR_MUX9SEL_Pos)
#define    INTMUX_CR_MUX9SEL                                      INTMUX_CR_MUX9SEL_Msk

#define    INTMUX_CR_MUX8SEL_Pos                                  (16U)
#define    INTMUX_CR_MUX8SEL_Msk                                  (0x3U << INTMUX_CR_MUX8SEL_Pos)
#define    INTMUX_CR_MUX8SEL                                      INTMUX_CR_MUX8SEL_Msk

#define    INTMUX_CR_MUX7SEL_Pos                                  (14U)
#define    INTMUX_CR_MUX7SEL_Msk                                  (0x3U << INTMUX_CR_MUX7SEL_Pos)
#define    INTMUX_CR_MUX7SEL                                      INTMUX_CR_MUX7SEL_Msk

#define    INTMUX_CR_MUX6SEL_Pos                                  (12U)
#define    INTMUX_CR_MUX6SEL_Msk                                  (0x3U << INTMUX_CR_MUX6SEL_Pos)
#define    INTMUX_CR_MUX6SEL                                      INTMUX_CR_MUX6SEL_Msk

#define    INTMUX_CR_MUX5SEL_Pos                                  (10U)
#define    INTMUX_CR_MUX5SEL_Msk                                  (0x3U << INTMUX_CR_MUX5SEL_Pos)
#define    INTMUX_CR_MUX5SEL                                      INTMUX_CR_MUX5SEL_Msk

#define    INTMUX_CR_MUX4SEL_Pos                                  (8U)
#define    INTMUX_CR_MUX4SEL_Msk                                  (0x3U << INTMUX_CR_MUX4SEL_Pos)
#define    INTMUX_CR_MUX4SEL                                      INTMUX_CR_MUX4SEL_Msk

#define    INTMUX_CR_MUX3SEL_Pos                                  (6U)
#define    INTMUX_CR_MUX3SEL_Msk                                  (0x3U << INTMUX_CR_MUX3SEL_Pos)
#define    INTMUX_CR_MUX3SEL                                      INTMUX_CR_MUX3SEL_Msk

#define    INTMUX_CR_MUX2SEL_Pos                                  (4U)
#define    INTMUX_CR_MUX2SEL_Msk                                  (0x3U << INTMUX_CR_MUX2SEL_Pos)
#define    INTMUX_CR_MUX2SEL                                      INTMUX_CR_MUX2SEL_Msk

#define    INTMUX_CR_MUX1SEL_Pos                                  (2U)
#define    INTMUX_CR_MUX1SEL_Msk                                  (0x3U << INTMUX_CR_MUX1SEL_Pos)
#define    INTMUX_CR_MUX1SEL                                      INTMUX_CR_MUX1SEL_Msk

